In [3]:
import pandas as pd 
import numpy as np
import random

In [14]:
df  = pd.DataFrame(np.random.randint(3,6,(4,5)), index = ['a','b','c','d'], columns  = ['x','y','z','u','v'])

In [15]:
df

   x  y  z  u  v
a  5  3  3  3  3
b  3  5  4  5  3
c  4  4  4  3  3
d  5  5  4  5  4

In [16]:
df.iloc[3]

x    5
y    5
z    4
u    5
v    4
Name: d, dtype: int32

In [17]:
df.loc[['c','d'],['z','u']]

   z  u
c  4  3
d  4  5

In [18]:
df.iloc[2:, 2:4]

   z  u
c  4  3
d  4  5

In [19]:
df['new'] = df['x']+df.y

In [20]:
df

   x  y  z  u  v  new
a  5  3  3  3  3    8
b  3  5  4  5  3    8
c  4  4  4  3  3    8
d  5  5  4  5  4   10

In [23]:
df.drop('x',axis =1)

   y  z  u  v  new
a  3  3  3  3    8
b  5  4  5  3    8
c  4  4  3  3    8
d  5  4  5  4   10

In [24]:
df

   x  y  z  u  v  new
a  5  3  3  3  3    8
b  3  5  4  5  3    8
c  4  4  4  3  3    8
d  5  5  4  5  4   10

In [25]:
df.drop('x', axis = 1, inplace = True)

In [26]:
df

   y  z  u  v  new
a  3  3  3  3    8
b  5  4  5  3    8
c  4  4  3  3    8
d  5  4  5  4   10

In [27]:
df= df.drop('a')

In [28]:
df

   y  z  u  v  new
b  5  4  5  3    8
c  4  4  3  3    8
d  5  4  5  4   10

### Pandas can be used in the place of sql

In [36]:
np.random.seed(23)
ser1 = pd.DataFrame(np.random.randn(4,5), index  = ['a','b','c','d'],columns = ['x','y','z','u','v'])

In [37]:
ser1

          x         y         z         u         v
a  0.666988  0.025813 -0.777619  0.948634  0.701672
b -1.051082 -0.367548 -1.137460 -1.322148  1.772258
c -0.347459  0.670140  0.322272  0.060343 -1.043450
d -1.009942  0.441736  1.128877 -1.838068 -0.938769

In [39]:
ser1[ser1<0]

          x         y         z         u         v
a       NaN       NaN -0.777619       NaN       NaN
b -1.051082 -0.367548 -1.137460 -1.322148       NaN
c -0.347459       NaN       NaN       NaN -1.043450
d -1.009942       NaN       NaN -1.838068 -0.938769

In [40]:
ser1.values[ser1.values<0]

array([-0.77761941, -1.05108156, -0.36754812, -1.13745969, -1.32214752,
       -0.34745899, -1.04345   , -1.00994188, -1.83806777, -0.93876863])

In [41]:
for i in ser1.columns:
    for j in ser1.index:
        if k[i][j] == True:
            print(i,j)

NameError: name 'k' is not defined